//функція приймає два параметри: масив об'єктів arr і назву властивості property, значення якої потрібно вибрати з кожного об'єкту.
function pluck(arr, property) {
    return arr.map(obj => obj[property]);
  }
//Функція map() застосовує задану функцію до кожного елемента масиву і повертає новий масив з результатами виклику цієї функції. У нашому випадку, ми викликаємо map() на масиві arr і передаємо функцію, яка використовує оператор доступу до властивості об'єкта [property] для отримання значення властивості з кожного об'єкта.
//Функція повертає масив, що містить імена об'єктів у масиві characters. 
const characters = [
    {name: "barney", age: 36},
    {name: "fred", age: 40}
  ];
  console.log(pluck(characters, 'name')); // ['barney', 'fred']
  